In [1]:
import pandas as pd

data = {'Name': ['John', 'Mary', 'Bob', 'Sarah', 'Tom', 'Lisa'], 
        'Department': ['IT', 'Marketing', 'Sales', 'IT', 'Finance', 'Marketing'], 
        'Age': [30, 40, 25, 35, 45, 28], 
        'Gender': ['Male', 'Female', 'Male', 'Female', 'Male', 'Female'], 
        'Salary': [50000, 60000, 45000, 55000, 70000, 55000],
        'Experience': [3, 7, 2, 5, 10, 4]}

employee_df = pd.DataFrame(data)

In [2]:
print(employee_df)

    Name Department  Age  Gender  Salary  Experience
0   John         IT   30    Male   50000           3
1   Mary  Marketing   40  Female   60000           7
2    Bob      Sales   25    Male   45000           2
3  Sarah         IT   35  Female   55000           5
4    Tom    Finance   45    Male   70000          10
5   Lisa  Marketing   28  Female   55000           4

In [3]:
# Using the iloc method to select the first 3 rows of the dataframe.
employee_df

    Name Department  Age  Gender  Salary  Experience
0   John         IT   30    Male   50000           3
1   Mary  Marketing   40  Female   60000           7
2    Bob      Sales   25    Male   45000           2
3  Sarah         IT   35  Female   55000           5
4    Tom    Finance   45    Male   70000          10
5   Lisa  Marketing   28  Female   55000           4

In [4]:
first_3_rows = employee_df.iloc[:3, 0:6]
print(first_3_rows)

   Name Department  Age  Gender  Salary  Experience
0  John         IT   30    Male   50000           3
1  Mary  Marketing   40  Female   60000           7
2   Bob      Sales   25    Male   45000           2

In [5]:
# Using the loc method to select all rows where the Department is "Marketing".

markn_dept = employee_df.loc[employee_df["Department"] == "Marketing"]
print(markn_dept)

   Name Department  Age  Gender  Salary  Experience
1  Mary  Marketing   40  Female   60000           7
5  Lisa  Marketing   28  Female   55000           4

In [6]:
# Using the iloc method to select the Age and Gender columns for the first 4 rows of the dataframe.

age_gender = employee_df.iloc[:4, 2:4]
print(age_gender)

   Age  Gender
0   30    Male
1   40  Female
2   25    Male
3   35  Female

In [7]:
# Using the loc method to select the Salary and Experience columns for all rows where the Gender is "Male".

salary_experience = employee_df.loc[(employee_df["Salary"] != "Experience") & (employee_df["Gender"] == "Male")]
print(salary_experience)

   Name Department  Age Gender  Salary  Experience
0  John         IT   30   Male   50000           3
2   Bob      Sales   25   Male   45000           2
4   Tom    Finance   45   Male   70000          10